Missing Data

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('E:\\Download\\df.csv')
data

    EEID     NAME GENDER   SALARY
0  EMPO1     JIYA      F      NaN
1  EMPO2    MEERA      F  20000.0
2  EMPO3     MEET    NaN  21000.0
3  EMPO1   SHIVAM      M  22000.0
4  EMPO5      NaN      F  23000.0
5  EMPO6  PRATHAM      M      NaN

In [13]:
data.isnull()

    EEID   NAME  GENDER  SALARY
0  False  False   False    True
1  False  False   False   False
2  False  False    True   False
3  False  False   False   False
4  False   True   False   False
5  False  False   False    True

In [14]:
data.isnull().sum()

EEID      0
NAME      1
GENDER    1
SALARY    2
dtype: int64

In [34]:
data.dropna()

    EEID    NAME GENDER   SALARY
1  EMPO2   MEERA      F  20000.0
3  EMPO1  SHIVAM      M  22000.0

In [27]:
import numpy as np

In [39]:
data.replace(np.nan, 30000)

    EEID     NAME GENDER   SALARY
0  EMPO1     JIYA      F  30000.0
1  EMPO2    MEERA      F  20000.0
2  EMPO3     MEET  30000  21000.0
3  EMPO1   SHIVAM      M  22000.0
4  EMPO5    30000      F  23000.0
5  EMPO6  PRATHAM      M  30000.0

Direct Column Update: By using data["SALARY"] = ..., you're directly updating the "SALARY" column with the modified values, replacing any NaN values with 30000.

numpy is used to access np.nan, which represents missing data (NaN) in pandas. By using np.nan, you can easily identify and replace missing values. pandas relies on numpy for handling these NaN values consistently across numerical operations.

In [40]:
data["SALARY"] = data["SALARY"].replace(np.nan,30000)
data

    EEID     NAME GENDER   SALARY
0  EMPO1     JIYA      F  30000.0
1  EMPO2    MEERA      F  20000.0
2  EMPO3     MEET    NaN  21000.0
3  EMPO1   SHIVAM      M  22000.0
4  EMPO5      NaN      F  23000.0
5  EMPO6  PRATHAM      M  30000.0

In [33]:
print(data["SALARY"].mean())

20666.666666666668

In [48]:
data

    EEID     NAME GENDER   SALARY
0  EMPO1     JIYA      F      NaN
1  EMPO2    MEERA      F  20000.0
2  EMPO3     MEET    NaN  21000.0
3  EMPO1   SHIVAM      M  22000.0
4  EMPO5      NaN      F  23000.0
5  EMPO6  PRATHAM      M      NaN

In [57]:
print(data.bfill())

    EEID     NAME GENDER   SALARY
0  EMPO1     JIYA      F  20000.0
1  EMPO2    MEERA      F  20000.0
2  EMPO3     MEET      M  21000.0
3  EMPO1   SHIVAM      M  22000.0
4  EMPO5  PRATHAM      F  23000.0
5  EMPO6  PRATHAM      M      NaN

In [59]:
print(data.ffill())

    EEID     NAME GENDER   SALARY
0  EMPO1     JIYA      F      NaN
1  EMPO2    MEERA      F  20000.0
2  EMPO3     MEET      F  21000.0
3  EMPO1   SHIVAM      M  22000.0
4  EMPO5   SHIVAM      F  23000.0
5  EMPO6  PRATHAM      M  23000.0

In [60]:
print(data.fillna("hy"))

    EEID     NAME GENDER   SALARY
0  EMPO1     JIYA      F       hy
1  EMPO2    MEERA      F  20000.0
2  EMPO3     MEET     hy  21000.0
3  EMPO1   SHIVAM      M  22000.0
4  EMPO5       hy      F  23000.0
5  EMPO6  PRATHAM      M       hy

In [ ]:
data.loc[...]: This is used to access and modify specific rows in the DataFrame.

In [62]:
data.loc[data['EEID'] == 'EMPO1', 'SALARY'] = 15000
data.loc[data['EEID'] == 'EMPO6', 'SALARY'] = 30000

print(data)

    EEID     NAME GENDER   SALARY
0  EMPO1     JIYA      F  15000.0
1  EMPO2    MEERA      F  20000.0
2  EMPO3     MEET    NaN  21000.0
3  EMPO1   SHIVAM      M  15000.0
4  EMPO5      NaN      F  23000.0
5  EMPO6  PRATHAM      M  30000.0

In [68]:
data.loc[data['EEID'] == 'EMPO1', 'SALARY'] = 15000
data.loc[data['EEID'] == 'EMPO6', 'SALARY'] = 30000
data.loc[data['EEID'] == 'EMPO3', 'GENDER'] = 'M'
data.loc[data['EEID'] == 'EMPO3', 'NAME'] = 'SHRESHA'
data.loc[data['EEID'] == 'EMPO5', 'NAME'] = 'GIVA'
print(data)

    EEID     NAME GENDER   SALARY
0  EMPO1     JIYA      F  15000.0
1  EMPO2    MEERA      F  20000.0
2  EMPO3  SHRESHA      M  21000.0
3  EMPO1   SHIVAM      M  15000.0
4  EMPO5     GIVA      F  23000.0
5  EMPO6  PRATHAM      M  30000.0

In [4]:
import pandas as pd
data = pd.read_csv('E:\\Download\\df.csv')
print(data["SALARY"].median())

21500.0

In [5]:
print(data["SALARY"].mode())

0    20000.0
1    21000.0
2    22000.0
3    23000.0
Name: SALARY, dtype: float64